cf_billing/Catalogs/энргСхемыПИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСхемыПИД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СхемаОРП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банкротство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДебитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииДебитора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Необязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргВидыОперацийПИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыОперацийПИД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРоли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПодэтапы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подэтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подэтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параллельно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргСхемыПИД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСледующийЭтап(Схема, Этап) Экспорт 

	Запрос = Новый Запрос;
	
	//Если Этап.Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота Тогда
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	энргСхемыПИДЭтапы1.Этап КАК Этап
	//		|ИЗ
	//		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы1
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
	//		|		ПО (энргСхемыПИДЭтапы.Ссылка = энргСхемыПИДЭтапы1.Ссылка)
	//		|			И энргСхемыПИДЭтапы1.НомерСтроки > энргСхемыПИДЭтапы.НомерСтроки
	//		|ГДЕ
	//		|	энргСхемыПИДЭтапы1.Ссылка = &Схема
	//		|	И ЕСТЬNULL(энргСхемыПИДЭтапы.Этап, ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ПустаяСсылка)) = &Этап
	//		|	И энргСхемыПИДЭтапы1.Этап.Тип = ЗНАЧЕНИЕ(Перечисление.энргТипыЭтапов.ИсполнительнаяРабота)
	//		|
	//		|УПОРЯДОЧИТЬ ПО
	//		|	энргСхемыПИДЭтапы1.НомерСтроки";
	//Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	энргСхемыПИДЭтапы1.Этап КАК Этап
			|ИЗ
			|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы1
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
			|		ПО (энргСхемыПИДЭтапы.Ссылка = энргСхемыПИДЭтапы1.Ссылка)
			|			И (энргСхемыПИДЭтапы.НомерСтроки = энргСхемыПИДЭтапы1.НомерСтроки - 1)
			|ГДЕ
			|	энргСхемыПИДЭтапы1.Ссылка = &Схема
			|	И ЕСТЬNULL(энргСхемыПИДЭтапы.Этап, ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ПустаяСсылка)) = &Этап";
	//КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("Этап", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Этап;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьСледующийЭтапПоДоговору(Организация, Район, Договор, Этап) Экспорт 
	Перем Результат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСрокиЭтаповДоговорСрезПоследних.Этап КАК Этап,
		|	бестСрокиЭтаповДоговорСрезПоследних.Подэтап КАК Подэтап,
		|	бестСрокиЭтаповДоговорСрезПоследних.Порядок КАК Порядок,
		|	бестСрокиЭтаповДоговорСрезПоследних.Срок КАК Срок,
		|	бестСрокиЭтаповДоговорСрезПоследних.Параллельно КАК Параллельно
		|ПОМЕСТИТЬ ВТ_СхемаДоговора
		|ИЗ
		|	РегистрСведений.бестСрокиЭтаповДоговор.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестСрокиЭтаповДоговорСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_СхемаДоговора.Порядок) КАК Порядок
		|ПОМЕСТИТЬ ВТ_МинимальныйПорядок
		|ИЗ
		|	ВТ_СхемаДоговора КАК ВТ_СхемаДоговора
		|ГДЕ
		|	ВТ_СхемаДоговора.Этап = &Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ_СхемаДоговора.Порядок) КАК Порядок
		|ПОМЕСТИТЬ ВТ_ПорядокЭтапа
		|ИЗ
		|	ВТ_СхемаДоговора КАК ВТ_СхемаДоговора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимальныйПорядок КАК ВТ_МинимальныйПорядок
		|		ПО ВТ_СхемаДоговора.Порядок > ВТ_МинимальныйПорядок.Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СхемаДоговора.Этап КАК Этап
		|ПОМЕСТИТЬ ВТ_Этап
		|ИЗ
		|	ВТ_ПорядокЭтапа КАК ВТ_ПорядокЭтапа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СхемаДоговора КАК ВТ_СхемаДоговора
		|		ПО ВТ_ПорядокЭтапа.Порядок = ВТ_СхемаДоговора.Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СхемаДоговора.Этап КАК Этап,
		|	ВТ_СхемаДоговора.Подэтап КАК Подэтап,
		|	ВТ_СхемаДоговора.Порядок КАК Порядок,
		|	ВТ_СхемаДоговора.Срок КАК Срок,
		|	ВТ_СхемаДоговора.Параллельно КАК Параллельно
		|ИЗ
		|	ВТ_СхемаДоговора КАК ВТ_СхемаДоговора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Этап КАК ВТ_Этап
		|		ПО ВТ_СхемаДоговора.Этап = ВТ_Этап.Этап
		|ИТОГИ
		|	МАКСИМУМ(Срок)
		|ПО
		|	Этап";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Этап", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЭтап = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаЭтап.Следующий() И ЗначениеЗаполнено(ВыборкаЭтап.Этап) Тогда
		Подэтапы = Новый Массив;
		
		Выборка = ВыборкаЭтап.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Подэтап) Тогда
				ПарамПодэтапа = Новый Структура("Подэтап, Порядок, Срок, Параллельно");
			    ЗаполнитьЗначенияСвойств(ПарамПодэтапа, Выборка);
				Подэтапы.Добавить(ПарамПодэтапа);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Подэтапы) Тогда
			Результат = Новый Структура("Этап, Подэтапы", ВыборкаЭтап.Этап, Подэтапы);
		Иначе
			Результат = Новый Структура("Этап, Срок", ВыборкаЭтап.Этап, ВыборкаЭтап.Срок);
		КонецЕсли;
	КонецЕсли;
		

	Возврат Результат;
КонецФункции

Функция ЭтапОбязателен(Этап, Схема) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Необязательный КАК Необязательный
		|ИЗ
		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|ГДЕ
		|	энргСхемыПИДЭтапы.Этап = &Этап
		|	И энргСхемыПИДЭтапы.Ссылка = &Схема";
	
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("Этап", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Необязательный;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

Функция ПолучитьЭтапПоНомеру(Схема, НомерЭтапа) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Этап КАК Этап
		|ИЗ
		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|ГДЕ
		|	энргСхемыПИДЭтапы.Ссылка = &Схема
		|	И энргСхемыПИДЭтапы.НомерСтроки = &НомерЭтапа";
	
	Запрос.УстановитьПараметр("НомерЭтапа", НомерЭтапа);
	Запрос.УстановитьПараметр("Схема", Схема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Этап;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СхемаОРП = Неопределено;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", ?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%");
	Запрос.УстановитьПараметр("СхемаОРП", ?(Параметры.Свойство("СхемаОРП", СхемаОРП), СхемаОРП, Ложь));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	энргСхемыПИД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.энргСхемыПИД КАК энргСхемыПИД
		|ГДЕ
		|	НЕ энргСхемыПИД.ПометкаУдаления
		|	И энргСхемыПИД.Наименование ПОДОБНО &СтрокаПоиска
		|	И энргСхемыПИД.СхемаОРП = &СхемаОРП";
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
